def cask_installed?(name)
  system("brew list --cask #{name} >/dev/null 2>&1")
end

# Base
tap "bevanjkay/formulae"
tap "bevanjkay/tap"

if OS.not_tier_one_configuration?
  cask "bevanjkay/tap/jq-static"
  cask "bevanjkay/tap/mas-static"
  cask "bevanjkay/tap/mole-static"
else
  brew "jq"
  brew "mas"
  brew "mole"
end

cask "bevanjkay/tap/zsh-autosuggestions-static"
cask "bevanjkay/tap/zsh-syntax-highlighting-static"
cask "font-sf-mono"
cask "google-chrome"
cask "hyper"
cask "stats", args: { no_quarantine: true }, greedy: true
cask "rectangle"

# Production
if OS.not_tier_one_configuration?
  cask "bevanjkay/tap/ffmpeg-static"
  cask "bevanjkay/tap/yt-dlp-static"
else
  brew "ffmpeg"
  brew "imagemagick"
  brew "yt-dlp"
end

cask "bmd-atem"
cask "bmd-videohub"
cask "dante-controller"
cask "dropbox"
cask "ndi-tools"
cask "propresenter" unless cask_installed?("propresenter@beta")
cask "pro7-media-sweeper"
cask "spotify", args: { no_quarantine: true }
mas "Amphetamine", id: 937984704
