# Base legacy
tap "bevanjkay/formulae"
tap "bevanjkay/tap"
cask "bevanjkay/tap/jq-static"
cask "bevanjkay/tap/mas-static"
cask "bevanjkay/tap/zsh-autosuggestions-static"
cask "bevanjkay/tap/zsh-syntax-highlighting-static"
cask "font-sf-mono"
cask "google-chrome"
cask "hyper"
cask "stats", args: { no_quarantine: true }, greedy: true
cask "rectangle"

# Production
cask "bevanjkay/tap/ffmpeg-static"
cask "bevanjkay/tap/yt-dlp-static"
cask "allen-and-heath-midi-control"
cask "bmd-atem"
cask "bmd-videohub"
cask "dante-controller"
cask "dropbox"
cask "ndi-tools"
cask "propresenter"
cask "pro7-media-sweeper"
cask "sq-mixpad"
cask "spotify", args: { no_quarantine: true }
mas "Amphetamine", id: 937984704
